[{"description":"Criar interface de quiz interativo com questões de múltipla escolha (A, B, C, D). Incluir timer/cronômetro para cada questão, sistema de pontuação e ranking, feedback imediato ao responder (mostrar se acertou/errou com cores), e revelar comentários/explicação somente após responder a questão.","type":"feature","passes":true,"id":1},{"description":"Criar página de administração/gerenciamento onde o usuário pode editar o tema do quiz e adicionar/editar/remover questões. Cada questão deve ter: título, 4 alternativas, resposta correta, e comentário explicativo. Salvar dados no localStorage.","type":"feature","passes":true,"id":2},{"description":"Fazer design totalmente responsivo para funcionar perfeitamente tanto em desktop quanto em mobile/celular. Interface moderna e intuitiva.","type":"feature","passes":true,"id":3},{"description":"Implementar sistema de login completo: criar tela de login bonita e responsiva com campos de usuário e senha, adicionar a logo (logo.jpg) no topo da tela de login e no header do app, implementar autenticação (pode usar usuários salvos no localStorage ou hardcoded para teste), proteger todas as rotas - só permitir acesso após login bem-sucedido, adicionar botão de logout.","type":"feature","passes":true,"id":4},{"description":"Melhorar a integração da logo no design: posicionar a logo no header/navbar do app após login, garantir que a logo fique bem visível e com tamanho adequado tanto em mobile quanto desktop, manter consistência visual com o tema escuro atual.","type":"feature","passes":true,"id":5},{"description":"Implementar login social com Google e Facebook: adicionar botões de login com Google OAuth e Facebook OAuth na tela de login, implementar autenticação OAuth (pode usar simulação/mock para desenvolvimento já que precisa de credenciais reais), manter opção de login tradicional também.","type":"feature","passes":true,"id":6},{"description":"Modernizar completamente a interface: usar design system mais atual com glassmorphism ou neumorphism, adicionar mais animações suaves e transições, melhorar tipografia e espaçamento, cards com sombras e efeitos hover modernos, sidebar/menu lateral responsivo, interface mais clean e profissional estilo SaaS 2025.","type":"feature","passes":true,"id":7},{"description":"Restruturar conceito de Quiz para Questões de Concurso: mudar toda nomenclatura de 'quiz' para 'concurso/prova', adicionar campo 'nome do concurso' (ex: ENEM 2024, OAB 2025), ano do concurso, órgão/instituição, categorizar questões por matéria/disciplina, permitir filtrar questões por concurso específico.","type":"feature","passes":true,"id":8},{"description":"Expandir painel administrativo com controle total: configurações gerais (nome da plataforma, cores do tema, logo), gerenciar concursos (criar, editar, deletar), gerenciar matérias/disciplinas, configurar tempo por questão, importar/exportar questões em CSV ou JSON, visualizar estatísticas de uso, gerenciar usuários cadastrados.","type":"feature","passes":true,"id":9},{"description":"Criar dashboard de evolução do aluno: página de perfil do aluno mostrando estatísticas pessoais, taxa de acerto por concurso e por matéria, gráficos de evolução ao longo do tempo, total de questões respondidas, questões certas vs erradas, tempo médio por questão, ranking comparativo com outros alunos, histórico de simulados realizados, badges/conquistas por desempenho.","type":"feature","passes":true,"id":10},{"description":"Expandir painel administrativo com controle total: criar seções separadas para Configurações Gerais (nome da plataforma, cores personalizadas, upload de logo, tempo padrão por questão), Gerenciar Concursos (CRUD completo de concursos), Gerenciar Disciplinas (CRUD de matérias), Gerenciar Usuários (listar, editar, deletar usuários), Estatísticas da Plataforma (total de questões, total de usuários, questões mais respondidas), Importar/Exportar Questões (JSON). Interface com sidebar de navegação entre seções.","type":"feature","passes":true,"id":11},{"description":"Criar dashboard completo de evolução do aluno: página /perfil ou /dashboard acessível pelo menu do usuário, mostrar estatísticas pessoais com gráficos bonitos (usar chart/gráfico CSS ou biblioteca), taxa de acerto geral e por disciplina, questões respondidas vs disponíveis, gráfico de evolução diária/semanal, tempo médio por questão, histórico de simulados com datas e resultados, ranking de alunos, badges/conquistas baseadas em desempenho, lista de disciplinas mais fortes e mais fracas.","type":"feature","passes":true,"id":12},{"description":"Adicionar sistema de cadastro manual completo: criar página de registro (/registro ou /cadastro) com formulário contendo campos Nome Completo, Email, Telefone, CPF (opcional), Senha e Confirmar Senha, validação de campos (email válido, telefone com máscara brasileira, CPF com validação), botão 'Criar Conta' que salva o usuário no localStorage, link na tela de login para 'Não tem conta? Cadastre-se', após cadastro redirecionar para login ou fazer login automático.","type":"feature","passes":true,"id":13},{"description":"Adicionar botão de voltar nas questões: adicionar botão 'Voltar' ou 'Sair' visível durante o simulado, ao clicar mostrar confirmação 'Tem certeza? O progresso será salvo', salvar progresso atual (questões respondidas até o momento) no localStorage, permitir retomar simulado de onde parou quando voltar, adicionar também opção 'Pausar Simulado' para salvar e continuar depois.","type":"feature","passes":true,"id":14},{"description":"Criar sistema de Módulos no painel admin: adicionar nova seção 'Gerenciar Módulos' no admin sidebar, módulo é um agrupamento de questões (ex: 'Módulo 1: Direito Constitucional Básico', 'Módulo 2: Matemática Avançada'), cada módulo tem: nome, descrição, lista de questões incluídas, concurso/disciplina associado, ordem de exibição, CRUD completo de módulos, na página inicial permitir filtrar por módulos além de concurso e disciplina.","type":"feature","passes":true,"id":15},{"description":"Incorporar ferramenta de IA para pesquisas: durante o simulado adicionar botão 'Pesquisar com IA' ou ícone de ajuda em cada questão, ao clicar abrir modal/sidebar com campo de pesquisa, permitir que o aluno digite dúvidas sobre a questão, simular integração com IA (pode ser um campo de texto que salva a dúvida e mostra mensagem 'Sua pesquisa foi registrada' ou integrar com API de IA se disponível), histórico de pesquisas do aluno, aviso de que usar IA é para estudo e não afeta pontuação.","type":"feature","passes":true,"id":16},{"description":"Corrigir botão de login do Gmail/Google: implementar OAuth real do Google usando window.location ou popup para redirecionar para https://accounts.google.com/o/oauth2/v2/auth com parâmetros corretos (client_id, redirect_uri, scope), se não tiver credenciais OAuth reais, adicionar instruções no console de como configurar e documentar que precisa de Google Cloud Console setup, alternativamente adicionar nota visual dizendo 'Em desenvolvimento - usar cadastro manual por enquanto'.","type":"bug","passes":true,"id":17},{"description":"Corrigir OAuth do Google: implementar redirecionamento real para OAuth do Google, usar window.location.href ou window.open para redirecionar para https://accounts.google.com/o/oauth2/v2/auth com parâmetros (client_id pode ser placeholder, mas URL deve ser válida), adicionar página de callback /auth/callback para receber o token, se não puder fazer OAuth completo, ao menos redirecionar para a página de login do Google para o usuário ver que funciona, adicionar instruções de como configurar Client ID no código.","type":"bug","passes":true,"id":18},{"description":"Criar sistema de análise inteligente de erros: quando o aluno erra uma questão, após mostrar o feedback, exibir análise detalhada do erro contendo: 1) Tipo de erro cometido (classificar em: Desconhecimento do Conteúdo, Confusão Conceitual, Erro de Interpretação, Distração/Pressa), 2) O que isso revela sobre a forma de estudo (ex: 'Você pode estar estudando superficialmente este tema'), 3) Como corrigir nos próximos estudos (dicas práticas e específicas). Usar lógica baseada em padrões: se primeira tentativa nesse tema = desconhecimento, se já errou similar = confusão conceitual, etc. Salvar histórico de tipos de erro por disciplina.","type":"feature","passes":true,"id":19},{"description":"Gerar plano de estudo personalizado de 7 dias: criar nova página /plano-de-estudo acessível pelo dashboard, analisar histórico de erros do aluno (últimos 20-30 erros), identificar disciplinas e temas com mais erros, gerar plano com: dia 1-7 cada dia tendo temas prioritários para revisar, quantidade de questões recomendadas por dia (baseado em desempenho), foco específico em revisão dos erros (quais questões refazer), orientação prática diária (como estudar, dicas), visualização em cards por dia com checklist, permitir marcar dias como concluídos.","type":"feature","passes":true,"id":20},{"description":"Corrigir bug de visibilidade nos filtros: nos seletores de disciplinas e matérias/concursos da página inicial, quando o mouse passa por cima (hover) ou quando está selecionado, o fundo fica branco mas as palavras também ficam brancas tornando ilegível. Corrigir CSS para: fundo branco + texto PRETO com bom contraste, ou manter tema escuro com destaque colorido, garantir que o texto seja sempre legível em todos os estados (normal, hover, active, selected).","type":"bug","passes":true,"id":21},{"description":"Adicionar painel lateral com ChatGPT gratuito: criar sidebar ou painel fixo no lado direito da tela (pode ser recolhível/expansível), integrar com API gratuita de chat (pode usar groq.com com llama gratuito, ou interface que abre chat.openai.com em iframe se permitido, ou criar interface de chat própria), permitir que aluno digite dúvidas e receba respostas em tempo real, manter histórico de conversas, botão para abrir/fechar o painel, ícone flutuante para acesso rápido, funcionar em todas as páginas especialmente durante simulados.","type":"feature","passes":true,"id":22},{"description":"Transformar o chat IA em um assistente com busca real na internet: quando o usuário fizer uma pergunta, o sistema deve fazer busca real usando API (pode integrar com DuckDuckGo API gratuita, SerpAPI, ou criar chamadas para endpoints de busca), implementar lógica que: 1) Recebe pergunta do usuário, 2) Faz busca na internet com a query, 3) Processa resultados e extrai informações relevantes, 4) Formata resposta de forma educacional, adicionar indicador visual 'Buscando na internet...' com animação de loading, mostrar fontes das respostas com links, funcionar especialmente bem para dúvidas de Matemática, Direito, Português, etc.","type":"feature","passes":true,"id":23},{"description":"Melhorar a página do Plano de Estudo: destacar visualmente o Dia 1 como próximo passo, adicionar botão 'Começar Dia 1' que expande o checklist e tarefas do dia, mostrar progresso em tempo real (quantas questões já foram feitas no dia), adicionar links diretos para começar simulado com os temas do dia, notificação/badge mostrando 'Novo plano disponível' quando houver atualização baseada em novos erros.","type":"feature","passes":true,"id":24},{"description":"Adicionar integração com múltiplas fontes de dados: além de busca no Google, integrar buscas em: Wikipedia (para definições e conceitos), Stack Exchange (para Matemática e Lógica), sites de legislação brasileira (para Direito), sites educacionais (Khan Academy, Brasil Escola), agregar resultados de múltiplas fontes e apresentar resposta consolidada com referências, implementar cache de respostas para perguntas frequentes.","type":"feature","passes":true,"id":25},{"description":"Integrar chat IA com API real de IA conversacional: substituir sistema de busca por integração com API de IA como OpenAI ChatGPT, Groq (Llama gratuito), ou alternativa gratuita, implementar chamadas para endpoint de chat completion, enviar contexto educacional nas mensagens (você é um tutor de concursos), processar streaming de respostas para experiência fluida, adicionar campo de configuração de API key no painel admin, mostrar respostas diretas e conversacionais ao invés de links de fontes, manter histórico de conversação para contexto, adicionar fallback para respostas pré-programadas se API não estiver configurada.","type":"feature","passes":true,"id":26},{"description":"Corrigir bug de disciplinas não aparecerem na tela inicial: investigar por que disciplinas adicionadas no admin não são exibidas nos filtros da página inicial, verificar se há problema no localStorage ou na leitura dos dados, garantir que ao criar nova disciplina ela seja imediatamente adicionada à lista global de disciplinas disponíveis, verificar se o componente de filtro está lendo corretamente a lista atualizada, adicionar logs para debug, testar fluxo completo: adicionar disciplina no admin → voltar para home → verificar se aparece no filtro.","type":"bug","passes":true,"id":27},{"description":"Implementar sistema completo de controle de acesso por concurso conforme especificação: criar estrutura de dados com entidades Usuário (id, nome, email, concursosAtivos[]), Concurso (id, nome, descrição, questões[], ativo), AcessoConcurso (usuarioId, concursoId, dataLiberação, dataExpiracao, status), no cadastro permitir selecionar concurso inicial ou deixar admin liberar depois, filtrar automaticamente questões para mostrar apenas do(s) concurso(s) que o aluno tem acesso, bloquear visualização de questões de outros concursos com tela de paywall/bloqueio, adicionar badge visual mostrando 'Seu Concurso Ativo' na tela inicial.","type":"feature","passes":true,"id":28},{"description":"Criar painel administrativo de gerenciamento de acessos: nova seção 'Gerenciar Acessos' no admin, listar todos os usuários com seus concursos ativos, botão para liberar/revogar acesso a concursos específicos para cada usuário, definir data de expiração de acesso (opcional), visualizar histórico de acessos liberados, dashboard mostrando estatísticas: quantos alunos por concurso, concursos mais acessados, acessos próximos de expirar, permitir liberação em massa (selecionar múltiplos alunos e liberar mesmo concurso).","type":"feature","passes":true,"id":29},{"description":"Adaptar fluxo do aluno com novo sistema de acesso: ao fazer login pela primeira vez, se não tiver concurso liberado, mostrar tela 'Aguardando Liberação de Acesso' com mensagem amigável, se tiver 1 concurso, ir direto para tela inicial com questões filtradas, se tiver múltiplos concursos, mostrar seletor 'Qual concurso deseja estudar hoje?', na tela inicial destacar qual concurso está ativo no momento, adicionar página /meus-concursos para ver todos os concursos que tem acesso, ao tentar acessar questão bloqueada, mostrar modal explicando que precisa de acesso ao concurso específico.","type":"feature","passes":true,"id":30},{"description":"Integrar contexto de concurso com IA de questões: quando aluno fizer pergunta no chat IA, enviar automaticamente no prompt o contexto: nome do concurso ativo, banca organizadora (se configurada), nível (fundamental/médio/superior), disciplina atual que está estudando, fazer a IA responder considerando esse contexto específico, exemplo de prompt: 'Você é um tutor especializado no concurso [NOME] da banca [BANCA]. O aluno está estudando [DISCIPLINA]. Responda a pergunta: [PERGUNTA]', garantir que IA não desvie para assuntos fora do contexto do concurso.","type":"feature","passes":true,"id":31},{"description":"Corrigir painel Gerenciar Acessos que não está mostrando usuários: debugar por que a lista de usuários não aparece, verificar se está lendo corretamente do localStorage a chave 'users', garantir que todos os usuários cadastrados (tanto por cadastro manual quanto por login social) sejam salvos na lista global de usuários, adicionar logs de debug, fazer a listagem funcionar mostrando: nome do usuário, email, data de cadastro, concursos ativos (se houver), botões de ação para liberar/revogar acesso, se não houver usuários mostrar mensagem 'Nenhum usuário cadastrado ainda'.","type":"bug","passes":true,"id":32},{"description":"Criar página de onboarding completo após cadastro: após usuário criar conta e fazer login pela primeira vez, redirecionar para página /onboarding (antes de ir para tela inicial), página deve ter design motivacional e acolhedor com a logo no topo, mensagem grande e inspiradora: 'Você está a um passo da sua APROVAÇÃO! 🎯', formulário com os campos: Qual concurso você vai fazer? (select ou input), Qual cargo você deseja? (input texto), Qual a banca organizadora? (select com opções: CESPE, FCC, FGV, VUNESP, Outra), Quais matérias deseja estudar? (textarea grande para listar múltiplas matérias), botão 'Iniciar Minha Jornada' para salvar e prosseguir, validação obrigatória de todos os campos.","type":"feature","passes":true,"id":33},{"description":"Integrar dados do onboarding com perfil do usuário: salvar as informações do onboarding (concurso objetivo, cargo desejado, banca, matérias) no perfil do usuário no localStorage, adicionar flag 'onboardingCompleto' no usuário para saber se já passou por essa etapa, usar essas informações para personalizar a experiência: mostrar no dashboard, usar no contexto da IA, filtrar questões relevantes, criar seção 'Meu Objetivo' no perfil/dashboard mostrando essas informações, permitir editar depois se necessário.","type":"feature","passes":true,"id":34},{"description":"Melhorar fluxo completo de cadastro até início de uso: 1) Usuário preenche formulário de cadastro (nome, email, senha, etc), 2) Após criar conta, redireciona para /onboarding, 3) Usuário preenche concurso objetivo, cargo, banca, matérias, 4) Clica em 'Iniciar Minha Jornada', 5) Sistema salva tudo e redireciona para tela inicial, 6) Se admin ainda não liberou acesso ao concurso, mostra tela aguardando liberação mas já com informações do objetivo do aluno visíveis, 7) Admin pode ver no painel quais concursos os alunos querem fazer e liberar acesso correspondente.","type":"feature","passes":true,"id":35},{"description":"Adicionar seleção de plano no onboarding: na página /onboarding, após os campos de concurso/cargo/banca/matérias, adicionar seção de escolha de plano com 2 cards lado a lado: PLANO INDIVIDUAL (acesso apenas ao concurso escolhido, preço normal, ex: R$ 97/mês, badge 'Popular') e PLANO PLUS (acesso a TODOS os concursos, preço maior, ex: R$ 197/mês, badge 'Completo', destaque visual de que é premium), usar design de pricing cards com comparação visual, botão de seleção em cada card (radio button estilizado), mostrar diferenças: Individual = 1 concurso | Plus = Todos os concursos, salvar escolha do plano junto com dados do onboarding.","type":"feature","passes":true,"id":36},{"description":"Implementar lógica de filtragem baseada no plano: criar função que verifica o plano do usuário (individual ou plus), se PLANO INDIVIDUAL: filtrar automaticamente para mostrar APENAS questões do concurso escolhido no onboarding, filtrar APENAS disciplinas daquele concurso específico, esconder outros concursos nos filtros da tela inicial, bloquear acesso a questões de outros concursos com mensagem 'Faça upgrade para Plano Plus', se PLANO PLUS: mostrar todos os concursos disponíveis, mostrar todas as disciplinas, sem restrições de acesso, adicionar badge 'Plus' no header do usuário.","type":"feature","passes":true,"id":37},{"description":"Criar página de comparação e upgrade de planos: criar rota /planos acessível pelo menu do usuário, mostrar comparação visual detalhada dos 2 planos com tabela ou cards, features do Plano Individual: acesso a 1 concurso, suporte básico, estatísticas pessoais, features do Plano Plus: TODOS os concursos, suporte prioritário, estatísticas avançadas, acesso ilimitado, IA com contexto expandido, botão 'Fazer Upgrade' para usuários do plano individual, mostrar plano atual do usuário com badge, permitir mudança de plano (simular ou preparar para integração de pagamento).","type":"feature","passes":true,"id":38},{"description":"Atualizar painel admin com gerenciamento de planos: na seção Gerenciar Acessos ou nova seção Gerenciar Planos, mostrar para cada usuário: plano atual (Individual ou Plus), concurso escolhido (se individual), data de contratação do plano, status (ativo/expirado), permitir admin alterar plano de qualquer usuário (upgrade/downgrade manual), adicionar estatísticas: quantos usuários em cada plano, receita potencial (simulada), planos próximos de expirar, filtrar usuários por tipo de plano.","type":"feature","passes":true,"id":39},{"description":"Adicionar indicadores visuais de plano em toda aplicação: badge 'Plus' ou 'Individual' ao lado do nome do usuário no header, no dashboard mostrar card com plano atual e benefícios, quando usuário individual tentar acessar conteúdo bloqueado, mostrar modal bonito de upsell explicando vantagens do Plano Plus com botão 'Fazer Upgrade Agora', na tela inicial, se for plano individual, mostrar apenas o concurso dele em destaque, se for plus, mostrar todos com badge 'Acesso Total Liberado', adicionar tooltip explicativo nos filtros bloqueados.","type":"feature","passes":true,"id":40},{"description":"Corrigir botão de cadastro pelo Google que está dando acesso bloqueado: investigar erro no fluxo de OAuth do Google, garantir que após login social o usuário seja criado corretamente no localStorage, verificar se está sendo redirecionado para onboarding após login Google/Facebook, corrigir qualquer erro de estado de autenticação, adicionar logs de debug para identificar onde está falhando, garantir que usuários de login social tenham as mesmas permissões que usuários de cadastro manual.","type":"bug","passes":true,"id":41},{"description":"Restringir acesso ao painel admin: criar sistema de roles/permissões (admin, user), apenas usuários com role 'admin' podem acessar /admin, criar lista de super admins (usernames ou emails autorizados, ex: 'admin@soquestoes.com'), verificar role antes de renderizar link 'Admin' no menu, se usuário comum tentar acessar /admin redirecionar para home com mensagem 'Acesso negado', remover completamente a seção admin do menu para usuários comuns, manter admin acessível apenas para você (super admin).","type":"feature","passes":true,"id":42},{"description":"Criar sistema de 3 planos: PLANO GRÁTIS (R$ 0/mês, 10 questões por dia, acesso básico, 1 concurso), PLANO INDIVIDUAL (R$ 97/mês, questões ilimitadas, escolhe matérias específicas, 1 concurso), PLANO PLUS (R$ 197/mês, acesso total, todos os concursos, todas as matérias), atualizar página de onboarding com 3 cards de planos, atualizar /planos com comparação dos 3 planos, plano padrão ao cadastrar deve ser GRÁTIS, adicionar opção de upgrade de Grátis para Individual ou Plus.","type":"feature","passes":true,"id":43},{"description":"Implementar sistema de limite diário de questões para plano gratuito: criar contador de questões respondidas por dia no localStorage (resetar à meia-noite), antes de iniciar simulado verificar: se usuário é plano gratuito E já respondeu 10 questões hoje, bloquear e mostrar modal 'Limite Diário Atingido - Faça upgrade para continuar estudando', mostrar contador visual 'X/10 questões hoje' para usuários gratuitos no header ou dashboard, incrementar contador após cada questão respondida, planos Individual e Plus = sem limite (ilimitado).","type":"feature","passes":true,"id":44},{"description":"Adicionar listas completas de matérias e cargos no onboarding: Matérias (multiselect com checkbox): Português, Matemática, Raciocínio Lógico, Inglês, Informática, Direito Constitucional, Direito Administrativo, Direito Penal, Direito Civil, Direito Tributário, Direito do Trabalho, Direito Previdenciário, História do Brasil, Geografia, Atualidades, Ética no Serviço Público, Administração Pública, Contabilidade, Economia, Estatística, Física, Química, Biologia. Cargos (select dropdown): Analista, Técnico, Auxiliar, Assistente, Agente, Auditor, Fiscal, Professor, Enfermeiro, Médico, Engenheiro, Advogado, Procurador, Promotor, Juiz, Delegado, Policial, Bombeiro, Outro (se selecionar Outro, mostrar campo de texto para digitar o cargo customizado).","type":"feature","passes":true,"id":45},{"description":"Atualizar todas as telas e lógicas com novo sistema de 3 planos: atualizar admin para mostrar 3 tipos de planos nas estatísticas, atualizar badges para incluir 'Grátis', 'Individual', 'Plus', atualizar regras de acesso considerando plano gratuito com limite de questões, mostrar CTA de upgrade estratégico para usuários gratuitos (especialmente quando atingir limite), permitir que plano gratuito acesse apenas o concurso escolhido (como Individual mas com limite diário), atualizar dashboard para mostrar limite diário restante para usuários gratuitos.","type":"feature","passes":true,"id":46},{"description":"Corrigir erro OAuth Google 'invalid_client': o erro 401 indica que o Client ID do Google não está configurado corretamente, como não temos credenciais OAuth reais do Google Cloud Console, remover temporariamente a funcionalidade de login social ou deixar apenas como DEMO desabilitado, adicionar modal explicativo quando clicar em Google/Facebook dizendo 'Login social em desenvolvimento - use cadastro manual por enquanto', ou configurar variáveis de ambiente para Client ID/Secret se fornecidas, documentar passo a passo de como configurar OAuth no Google Cloud Console.","type":"bug","passes":true,"id":47},{"description":"Adicionar controles administrativos completos no painel Gerenciar Acessos: para cada usuário adicionar botões/ações: SUSPENDER ACESSO (bloqueia login temporariamente, status 'suspenso'), EXCLUIR USUÁRIO (remove permanentemente do sistema com confirmação), ALTERAR PLANO (dropdown para escolher Grátis/Individual/Plus e aplicar imediatamente), CANCELAR ACESSO (revoga acesso aos concursos), REATIVAR (se estiver suspenso), adicionar coluna STATUS (Ativo, Suspenso, Pendente Aprovação), adicionar filtros para visualizar por status, permitir ações em massa (selecionar múltiplos usuários e aplicar ação), adicionar logs de ações administrativas (histórico de mudanças).","type":"feature","passes":true,"id":48},{"description":"Implementar sistema de aprovação manual de acesso: quando aluno se cadastra, status inicial é 'Pendente Aprovação', aluno não consegue acessar questões até admin aprovar, tela de espera para aluno: 'Cadastro realizado! Aguardando aprovação do administrador. Você receberá notificação quando for aprovado.', no admin, mostrar badge/notificação de 'X novos cadastros aguardando aprovação', seção especial 'Cadastros Pendentes' com botão APROVAR que: define status como Ativo, atribui plano inicial (Gratuito por padrão ou admin escolhe), libera acesso ao concurso solicitado, botão REJEITAR que exclui o cadastro com mensagem de motivo.","type":"feature","passes":true,"id":49},{"description":"Remover acesso do aluno para mudar plano: remover botão 'Fazer Upgrade' do menu do aluno, remover acesso à página /planos para alunos (apenas admin pode acessar), quando aluno clicar em opções de upgrade, mostrar modal: 'Para alterar seu plano, entre em contato com o administrador ou acesse o checkout de pagamento', substituir por botão 'Solicitar Upgrade' que: abre formulário de solicitação, envia notificação para admin, redireciona para checkout de pagamento (se implementado), admin recebe lista de solicitações de upgrade e pode aprovar/negar.","type":"feature","passes":true,"id":50},{"description":"Criar sistema de checkout de pagamento: criar 3 páginas de checkout: /checkout/gratuito, /checkout/individual, /checkout/plus, cada página mostra: detalhes do plano, preço, benefícios, formulário de pagamento (pode ser integração com Mercado Pago, PagSeguro, Stripe, ou simulação), após 'pagamento' (simulado ou real): atualiza status do usuário para 'Aguardando Aprovação de Pagamento', notifica admin, admin confirma pagamento manualmente e ativa o plano, adicionar campo 'dataPagamento', 'statusPagamento' (Pendente, Aprovado, Recusado), criar página admin para gerenciar pagamentos pendentes.","type":"feature","passes":true,"id":51},{"description":"Implementar sistema de suspensão de usuários: quando admin suspende um usuário, adicionar flag 'suspenso: true' no perfil, ao tentar fazer login, verificar se está suspenso e mostrar mensagem: 'Sua conta foi suspensa. Entre em contato com o administrador.', se já estiver logado e for suspenso, ao tentar acessar qualquer página protegida: logout automático + mensagem de suspensão, admin pode adicionar motivo da suspensão (salvar no perfil), admin pode reativar a qualquer momento clicando em REATIVAR.","type":"feature","passes":true,"id":52},{"description":"Criar nova seção 'Criar Pacote de Concurso' no admin sidebar: formulário completo para criar pacote com campos: Nome do Concurso, Banca Organizadora, Ano, Órgão, Descrição do pacote, Número de questões que vai criar, Disciplinas incluídas (multiselect), Atribuir a aluno específico (opcional - select com lista de alunos), Preço do pacote (opcional), ao salvar criar estrutura de pacote no localStorage, gerar IDs únicos para cada pacote, mostrar lista de pacotes criados com status (quantas questões criadas / total).","type":"feature","passes":true,"id":53},{"description":"Criar interface de adição de questões em massa ao pacote: após criar pacote, abrir tela 'Adicionar Questões ao Pacote [NOME]', formulário repetível para adicionar múltiplas questões rapidamente: Enunciado da questão, Alternativa A, B, C, D, Resposta correta, Comentário/Explicação, Disciplina (auto-preenchida com as do pacote), botão '+' para adicionar nova questão sem sair da tela, contador visual 'X de Y questões adicionadas', botão 'Salvar Todas' que adiciona as questões ao sistema vinculadas ao pacote, opção de importar questões de arquivo JSON/CSV.","type":"feature","passes":true,"id":54},{"description":"Implementar sistema de atribuição de pacotes a alunos: no admin, seção 'Gerenciar Pacotes', listar todos os pacotes criados, para cada pacote mostrar: nome, banca, número de questões, alunos atribuídos, botão 'Atribuir a Aluno' que abre modal com: lista de alunos cadastrados (checkbox múltiplo), data de liberação (opcional), data de expiração (opcional), ao atribuir: aluno recebe acesso exclusivo ao pacote, pacote aparece na tela inicial do aluno como opção de estudo, estatísticas de uso do pacote por aluno.","type":"feature","passes":true,"id":55},{"description":"Manter e melhorar opção de criar questões individuais: manter seção 'Gerenciar Questões' atual funcionando, adicionar opção 'Modo de Criação' com toggle: INDIVIDUAL (questão por questão) ou PACOTE (múltiplas questões), no modo individual manter interface atual simples, adicionar possibilidade de converter questões individuais em pacote depois, permitir clonar questões existentes para agilizar criação.","type":"feature","passes":true,"id":56},{"description":"Criar visualização e gerenciamento de pacotes no painel aluno: quando aluno tem pacote atribuído, mostrar na tela inicial card especial 'Pacotes Exclusivos para Você', card mostra: nome do pacote, banca, número de questões, progresso (X% concluído), botão 'Iniciar Pacote' que filtra apenas questões daquele pacote, ao finalizar pacote mostrar certificado ou conquista, estatísticas específicas do pacote no dashboard.","type":"feature","passes":true,"id":57},{"description":"Adicionar controles avançados de pacotes no admin: duplicar pacote existente (criar cópia), editar informações do pacote, adicionar/remover questões do pacote, excluir pacote (com confirmação - opção de manter ou excluir questões), exportar pacote completo (JSON) para backup, importar pacote de arquivo, marcar pacote como 'Premium' (apenas para planos pagos), definir preço individual do pacote, histórico de modificações do pacote.","type":"feature","passes":true,"id":58},{"description":"Criar banco extenso de questões de concursos reais: gerar pelo menos 100-200 questões de provas recentes (2024, 2025, 2026) de diversas bancas (CESPE/CEBRASPE, FCC, FGV, VUNESP, IBFC, Quadrix, FUNDATEC, CONSULPLAN, AOCP, Instituto AOCP), incluir questões de concursos populares: ENEM, Concursos da Receita Federal, TRFs, TRTs, Polícia Federal, Polícia Civil, Bombeiros, INSS, Prefeituras, Tribunais, OAB, cobrir todas as disciplinas: Português, Matemática, Raciocínio Lógico, Informática, Direitos (Constitucional, Administrativo, Penal, Civil), Atualidades, cada questão deve ter: enunciado realista, 4 alternativas, resposta correta, comentário explicativo detalhado (2-3 parágrafos), campos: banca, ano, cargo, assunto específico (ex: 'Regência Verbal', 'Função Quadrática', 'Princípios Administrativos').","type":"feature","passes":true,"id":59},{"description":"Implementar sistema de filtros avançados na tela inicial: adicionar painéis de filtro expansíveis/colapsáveis: Filtrar por BANCA (multiselect: CESPE, FCC, FGV, VUNESP, IBFC, Quadrix, FUNDATEC, CONSULPLAN, AOCP, Todas), Filtrar por MATÉRIA (multiselect com todas as 23 disciplinas), Filtrar por ASSUNTO (list dinâmica baseada na matéria escolhida - ex: Português → Regência, Concordância, Interpretação de Texto, etc.), Filtrar por ANO (multiselect: 2024, 2025, 2026), Filtrar por CARGO (multiselect: Analista, Técnico, Agente, etc.), botão 'Aplicar Filtros' que filtra questões em tempo real, botão 'Limpar Filtros', contador mostrando 'X questões encontradas com os filtros aplicados'.","type":"feature","passes":true,"id":60},{"description":"Atualizar regra do plano gratuito: modificar lógica para que plano gratuito tenha ACESSO TOTAL a todos os concursos, todas as matérias, todos os filtros, PORÉM mantém limite de 10 questões por dia, remover qualquer restrição de concurso único para usuários gratuitos, permitir navegar e filtrar livremente, apenas bloquear quando atingir 10 questões respondidas no dia, atualizar textos explicativos do plano gratuito em todos os lugares, mensagem clara: 'Plano Gratuito - Acesso Total com 10 questões/dia'.","type":"feature","passes":true,"id":61},{"description":"Corrigir bug da página Meus Planos que não abre: investigar rota /planos, verificar se existe erro de importação ou renderização, garantir que a página seja acessível via menu dropdown do usuário, adicionar logs de erro no console, testar navegação de todas as rotas relacionadas a planos, se necessário recriar rota ou componente, garantir que tanto alunos quanto admin consigam acessar (com permissões diferentes).","type":"bug","passes":true,"id":62},{"description":"Corrigir modal 'Fazer Upgrade' que não abre: investigar por que modal não está sendo exibido quando clicado, verificar estado do modal (isOpen), verificar z-index e CSS que pode estar escondendo, adicionar logs de debug ao clicar no botão, garantir que função de abrir modal está sendo chamada corretamente, testar em diferentes contextos (dashboard, menu, após atingir limite), adicionar fallback caso modal falhe (redirecionar para página dedicada).","type":"bug","passes":true,"id":63},{"description":"Adicionar link do WhatsApp em todos os pontos de contato: atualizar modal de upgrade/contato com botão verde do WhatsApp com link https://api.whatsapp.com/send?phone=5521980645070, adicionar ícone do WhatsApp, mensagem pré-preenchida: 'Olá! Gostaria de fazer upgrade para [PLANO]. Meu ID é [USER_ID]', adicionar também em: tela de aguardando aprovação (botão para entrar em contato), modal de limite diário atingido, página de planos (botão 'Falar com Suporte'), footer do site (link de contato), garantir que abre em nova aba ou app do WhatsApp.","type":"feature","passes":true,"id":64},{"description":"Adicionar botão 'Ver Resposta' durante a questão: antes do aluno responder, mostrar botão 'Ver Resposta' próximo às alternativas, ao clicar mostrar qual é a alternativa correta (destacar em verde), NÃO revelar comentário ainda, aluno ainda pode escolher responder normalmente ou usar a dica, se usar 'Ver Resposta' marcar como 'questão visualizada' mas não contar como respondida incorretamente, adicionar indicador visual claro de qual é a correta.","type":"feature","passes":true,"id":65},{"description":"Adicionar botão 'Ver Comentário' após responder ou ver resposta: APENAS após aluno responder OU clicar em 'Ver Resposta', mostrar botão 'Ver Comentário' abaixo do feedback, comentário inicialmente OCULTO (collapsed), ao clicar no botão revelar comentário completo com animação de expansão, permitir recolher comentário novamente, usar acordeão ou modal para exibição.","type":"feature","passes":true,"id":66},{"description":"Integrar links de pagamento do Mercado Pago: substituir lógica de upgrade simulado por redirecionamento direto para Mercado Pago, PLANO INDIVIDUAL → https://mpago.la/1ym97zu, PLANO PLUS → https://mpago.la/1AtgXnn, atualizar todos os botões de upgrade/compra para redirecionar aos links corretos, adicionar ícone do Mercado Pago nos botões, mensagem: 'Você será redirecionado para o Mercado Pago', após pagamento aluno deve entrar em contato com ID para ativação, adicionar instruções pós-pagamento.","type":"feature","passes":true,"id":67},{"description":"Corrigir bug de exclusão de usuário no admin: investigar por que botão 'Excluir' não está funcionando, verificar se função deleteUser() está sendo chamada, verificar se está removendo do localStorage corretamente (chaves: quiz_registered_users, quiz_user_accesses, quiz_auth_user se for o logado), adicionar logs de debug, garantir que modal de confirmação funciona, após excluir remover da lista visual imediatamente, adicionar mensagem de sucesso 'Usuário excluído com sucesso', se usuário logado for excluído fazer logout automático.","type":"bug","passes":true,"id":68},{"description":"Atualizar mensagens de pagamento: remover instrução de envio de comprovante, adicionar mensagem clara: 'Cartão e PIX: ativação IMEDIATA após pagamento', 'Boleto: aguarde 3 a 4 dias para compensação bancária', substituir por mensagem: 'Seu plano será ativado automaticamente!', adicionar botão WhatsApp apenas para 'Tirar Dúvidas', remover etapa de confirmação manual.","type":"feature","passes":true,"id":69},{"description":"Criar sistema de capas/módulos por matéria intuitivo: ao escolher concurso, mostrar grid de matérias com capas visuais em miniatura (cards coloridos), cada capa tem: ícone da matéria, nome, número de questões disponíveis, progresso do aluno (%), ao clicar em uma capa abre página dedicada daquela matéria com: banner da matéria no topo, lista de questões filtradas apenas daquela matéria, estatísticas específicas da matéria, botão 'Iniciar Estudo', design muito visual e intuitivo tipo Netflix/Spotify, remover seletor 'Qual concurso estudar hoje'.","type":"feature","passes":true,"id":70},{"description":"Reestruturar completamente as regras dos 3 planos: PLANO GRATUITO (R$ 0): acesso a TODOS os concursos da plataforma, SEM acesso aos comentários das questões (botão Ver Comentário bloqueado), estatísticas básicas/limitadas apenas (não vê gráficos avançados, ranking limitado), 10 questões por dia, pode navegar e ver todas as matérias mas sem comentários. PLANO INDIVIDUAL (R$ 97): escolhe apenas 1 concurso específico, escolhe matérias, cargo, banca, admin monta o pacote personalizado depois, mostrar popup: 'Seu pacote personalizado ficará pronto em até 7 dias', acesso completo com comentários, estatísticas completas, questões ilimitadas do seu concurso. PLANO PLUS (R$ 197): acesso TOTAL a tudo, questões sob demanda (pode solicitar criação de novas), IA ChatGPT incluído no plano (botão sempre visível), comentários completos, estatísticas avançadas, todos os concursos.","type":"feature","passes":true,"id":71},{"description":"Adicionar escolha no onboarding/cadastro: após preencher dados pessoais, mostrar tela de decisão com 2 cards grandes: 'VER PLANOS ATUAIS' (navegar pelos concursos e conteúdos já disponíveis, escolher entre Gratuito/Individual/Plus normal) e 'ESCOLHER PACOTE ESPECÍFICO' (criar pacote personalizado, escolher concurso, cargo, banca, matérias específicas, aguardar montagem em 7 dias), cada opção leva a fluxo diferente, salvar escolha do usuário, se escolher pacote específico coletar: concurso desejado, cargo, banca, matérias (multiselect), criar solicitação no admin para você montar.","type":"feature","passes":true,"id":72},{"description":"Implementar sistema de solicitações de pacotes personalizados: quando aluno escolhe 'Pacote Específico' ou qualquer plano solicita questões customizadas, criar registro da solicitação com status 'Aguardando Montagem', no admin criar nova seção 'Solicitações de Pacotes' mostrando: lista de solicitações pendentes, dados do aluno, concurso/cargo/banca/matérias solicitados, plano escolhido (Individual ou Plus), botão 'Iniciar Montagem', botão 'Marcar como Pronto', quando marcar como pronto notificar aluno (pode ser flag no dashboard), aluno vê mensagem: 'Seu pacote personalizado está pronto!'.","type":"feature","passes":true,"id":73},{"description":"Bloquear comentários para plano gratuito: quando usuário gratuito clicar em 'Ver Comentário', mostrar modal de upsell: 'Comentários disponíveis apenas nos planos pagos', 'Faça upgrade para ter acesso a explicações detalhadas', botões de upgrade para Individual/Plus com links Mercado Pago, manter botão 'Ver Resposta' funcionando normalmente para gratuitos, apenas comentários são bloqueados, adicionar ícone de cadeado (🔒) no botão de comentário para gratuitos.","type":"feature","passes":true,"id":74},{"description":"Adicionar indicadores de IA no plano Plus: para usuários Plus, mostrar badge 'IA Incluída' no header, botão de IA sempre visível e destacado (sem limite de uso), para outros planos mostrar badge 'IA Limitada' ou ocultar botão, atualizar descrição do plano Plus em todos os lugares: 'ChatGPT incluído para estudos', 'Criação de questões sob demanda', na página de planos destacar esse diferencial como premium.","type":"feature","passes":true,"id":75},{"description":"Adicionar campo de texto livre para matérias customizadas: no formulário de pacote personalizado, manter as 23 checkboxes de matérias existentes, adicionar abaixo um campo textarea com label 'Outras matérias (descreva):', placeholder 'Digite matérias adicionais que não estão na lista acima, separadas por vírgula', salvar tanto as checkboxes selecionadas quanto o texto livre, mostrar ambos na solicitação do admin, permitir aluno especificar matérias muito específicas (ex: 'Direito Tributário Avançado', 'Matemática Financeira Aplicada').","type":"feature","passes":true,"id":76},{"description":"Adicionar campo de texto condicional para banca: no select de Banca, manter opções: CESPE/CEBRASPE, FCC, FGV, VUNESP, IBFC, Quadrix, FUNDATEC, CONSULPLAN, Outra, quando selecionar 'Outra', mostrar campo de texto abaixo: 'Qual banca? (especifique)', input type text com placeholder 'Digite o nome da banca', salvar a banca customizada na solicitação, campo aparece/desaparece dinamicamente ao mudar seleção.","type":"feature","passes":true,"id":77},{"description":"Criar estado de 'Aguardando Montagem' para plano Individual: quando aluno faz upgrade de Gratuito para Individual e escolhe pacote personalizado, mudar status para 'Aguardando Montagem', aluno TEM acesso à plataforma mas sem questões do pacote personalizado (ainda pode usar questões gerais da plataforma), mostrar banner/card destacado no dashboard: 'Seu pacote está sendo preparado! Pronto em até 7 dias', adicionar botão WhatsApp destacado: 'Tirar Dúvidas sobre meu Pacote', countdown de dias restantes (opcional), quando admin marcar como 'Pronto', liberar questões completas do pacote.","type":"feature","passes":true,"id":78},{"description":"Atualizar modal/página de upgrade com informações completas e claras: ao clicar em 'Fazer Upgrade' mostrar modal detalhado com: PLANO INDIVIDUAL (R$ 97/mês): 'Você escolhe concurso, cargo, banca e matérias', 'NÓS montamos seu pacote personalizado', 'Prazo: até 7 dias úteis', 'Durante a espera: acesso à plataforma mantido', 'Após pagamento: aguarde montagem', 'Dúvidas: WhatsApp disponível', [Botão: Pagar Individual - Mercado Pago]. PLANO PLUS (R$ 197/mês): 'Acesso TOTAL imediato', 'TODOS os concursos disponíveis', 'Questões sob demanda (solicite quando quiser)', 'ChatGPT incluído sem limite', 'Suporte prioritário', [Botão: Pagar Plus - Mercado Pago]. Adicionar seção 'O que acontece após o pagamento?' com timeline visual.","type":"feature","passes":true,"id":79},{"description":"Criar página/tela dedicada de aguardando montagem: quando aluno Individual está aguardando, criar rota /aguardando-pacote ou mostrar na home card especial: banner grande com ícone de construção/ampulheta, 'Seu Pacote Personalizado está sendo preparado', progresso visual (ex: Dia 2 de 7), 'Estamos montando questões exclusivas para:', listar concurso, cargo, banca, matérias solicitadas, 'Você receberá notificação quando estiver pronto', botão verde grande do WhatsApp: 'Precisa falar conosco?', link com mensagem pré-pronta: 'Olá! Quero tirar dúvidas sobre meu pacote (ID: [USER_ID])'.","type":"feature","passes":true,"id":80},{"description":"Reestruturar navegação: capas de matérias dentro do concurso escolhido: remover grid de matérias da tela inicial, na tela inicial mostrar lista/grid de CONCURSOS disponíveis (baseado no plano), ao clicar em um concurso, abrir página daquele concurso (/concurso/[id]) com: banner do concurso, informações (banca, ano, órgão), grid de capas de matérias daquele concurso específico, ao clicar em matéria iniciar estudo filtrado por concurso + matéria, criar hierarquia: Home → Escolhe Concurso → Vê Matérias → Estuda.","type":"feature","passes":true,"id":81},{"description":"Redirecionar para checkout ANTES de mostrar progresso no plano Individual: quando aluno seleciona Plano Individual e preenche formulário, ao clicar em confirmar/pagar, redirecionar IMEDIATAMENTE para link do Mercado Pago (https://mpago.la/1ym97zu), salvar solicitação como 'Aguardando Pagamento', após pagamento (webhook ou manualmente pelo admin), mudar status para 'Aguardando Montagem' e AÍ mostrar tela de progresso/aguardando, criar fluxo: Escolhe Individual → Preenche dados → Redireciona Mercado Pago → Paga → Volta plataforma → Vê progresso.","type":"feature","passes":true,"id":82},{"description":"Corrigir bug de matérias customizadas não aparecerem na solicitação: verificar campo 'materiasCustomizadas' ou similar que armazena o texto livre, garantir que ao salvar solicitação esse campo seja incluído, no admin garantir que exibe tanto 'materias' (array de checkboxes) quanto 'materiasCustomizadas' (string de texto livre), adicionar seção separada na visualização: 'Matérias selecionadas' e 'Matérias adicionais descritas', testar fluxo completo de criação até visualização no admin.","type":"bug","passes":true,"id":83},{"description":"Adicionar opção no admin para incluir matérias extras: na visualização da solicitação no admin, adicionar campo editável 'Matérias Extras (se possível)', textarea que admin pode preencher: 'Posso incluir: [matérias adicionais]' ou 'Não disponível no momento', salvar essa resposta na solicitação, quando marcar como pronto, mostrar essas informações ao aluno, permitir admin comunicar o que conseguiu/não conseguiu incluir.","type":"feature","passes":true,"id":84},{"description":"Corrigir atualização de status quando pacote fica pronto: quando admin clica 'Marcar como Pronto' na solicitação, garantir que: status da solicitação muda para 'pronto', status do usuário (packageStatus) muda para 'pronto', banner na home do aluno atualiza mostrando 'Pronto!', notificação/badge aparece no dashboard, verificar função que atualiza solicitação e user access data, adicionar logs para debug, testar fluxo completo admin → aluno.","type":"bug","passes":true,"id":85},{"description":"Adicionar menu completo de perfil do usuário: no dropdown do avatar/menu do usuário adicionar novas opções: '📝 Editar Perfil' (rota /perfil/editar com: upload de foto de perfil, alterar nome, email, telefone, CPF, senha, preview da foto, botão salvar), '⚙️ Meus Dados' (visualização read-only de todos os dados com botão editar), '💬 Fale Conosco' (abrir modal ou página com: botão WhatsApp grande, email de contato, horário de atendimento), manter opções existentes (Dashboard, Meus Planos, Logout).","type":"feature","passes":true,"id":86},{"description":"Adicionar status visual sem apagar usuário excluído: modificar função deleteUser para NÃO remover usuário do localStorage, apenas marcar como 'excluído: true', adicionar campo 'status' no usuário: 'ativo', 'suspenso', 'excluido', na lista do admin mostrar TODOS os usuários com badge de status: verde (Ativo), amarelo (Suspenso), cinza (Excluído), permitir filtrar por status, usuários excluídos ficam visíveis mas não podem fazer login, adicionar coluna STATUS na tabela admin, ao tentar login verificar se status != 'excluido'.","type":"feature","passes":true,"id":87},{"description":"Criar página de perfil/editar perfil: criar rota /perfil/editar, formulário com: seção Foto de Perfil (upload de imagem, preview circular, botão 'Alterar Foto', salvar como base64 ou URL no localStorage), campos editáveis: Nome Completo, Email, Telefone, CPF, seção Alterar Senha (senha atual, nova senha, confirmar nova), botão 'Salvar Alterações', validação de campos, mensagem de sucesso após salvar, foto de perfil aparece no header/avatar após salvar.","type":"feature","passes":true,"id":88},{"description":"Implementar bloqueio de acesso ao plano Individual até pagamento: quando aluno escolhe Plano Individual e preenche formulário, salvar como status 'aguardando_pagamento', redirecionar IMEDIATAMENTE para Mercado Pago (https://mpago.la/1ym97zu), enquanto status for 'aguardando_pagamento': bloquear acesso a funcionalidades do plano Individual, mostrar tela: 'Complete seu pagamento para continuar', botão para voltar ao checkout, apenas APÓS você (admin) confirmar pagamento manualmente mudar status para 'pagamento_confirmado' → 'aguardando_montagem', só então mostrar tela de progresso da criação.","type":"feature","passes":true,"id":89},{"description":"Criar sistema de progresso em 4 estágios controlado pelo admin: adicionar enum de status de criação: 'nao_iniciado', 'material_iniciado', 'em_fase_acabamento', 'quase_pronto', 'pronto', na solicitação do admin adicionar seção 'Progresso da Criação' com 4 checkboxes/radio buttons: ☐ Material Iniciado (0-25%), ☐ Material em Fase de Acabamento (25-50%), ☐ Material Quase Pronto (50-75%), ☐ Material Pronto (100%), ao marcar cada checkbox atualizar automaticamente o status da solicitação e do aluno, salvar timestamp de cada mudança de status, calcular progresso percentual baseado no estágio.","type":"feature","passes":true,"id":90},{"description":"Sincronizar progresso em tempo real para o aluno: na página /aguardando-pacote mostrar barra de progresso dinâmica baseada no status atual, exibir mensagem correspondente a cada estágio: 'Material Iniciado' → 'Estamos começando a preparar suas questões...', 'Em Fase de Acabamento' → 'Já temos metade do seu pacote pronto!', 'Quase Pronto' → 'Falta pouco! Estamos finalizando os detalhes...', 'Pronto' → 'Seu pacote está completo e disponível!', atualizar barra visual (0%, 25%, 50%, 75%, 100%), mostrar ícones/animações diferentes para cada fase.","type":"feature","passes":true,"id":91},{"description":"Remover campo de resposta sobre matérias adicionais: remover textarea 'Resposta do Admin' sobre matérias extras, remover seção 'Posso incluir estas matérias?', manter apenas visualização das matérias solicitadas (checkboxes + customizadas), admin vê o que foi solicitado mas não precisa responder textualmente, simplificar interface da solicitação.","type":"feature","passes":true,"id":92},{"description":"Adicionar botão especial 'Começar Jornada' quando pronto: quando status = 'pronto' (100%), na página /aguardando-pacote e no banner da home, substituir botões normais por botão destacado grande: '🎉 Clique aqui para começar sua jornada!', botão com animação de pulso/brilho, ao clicar redirecionar para: /concurso/[concurso_do_pacote] (mostrando as matérias do pacote personalizado), marcar pacote como 'iniciado' pelo aluno, adicionar confete/celebração visual ao clicar.","type":"feature","passes":true,"id":93},{"description":"Criar tela de 'Aguardando Pagamento' específica: para alunos com status 'aguardando_pagamento', mostrar tela dedicada: 'Complete seu Pagamento', 'Seu pacote está reservado mas precisa confirmar pagamento', botão grande 'Ir para Checkout' (link Mercado Pago), timer de expiração (opcional: 'Pagamento expira em 24h'), instruções de pagamento (PIX imediato, Cartão imediato, Boleto 3-4 dias), ao completar pagamento (admin confirma) → liberar acesso automático.","type":"feature","passes":true,"id":94},{"description":"Adicionar confirmação de pagamento no admin: na seção Solicitações, para solicitações com status 'aguardando_pagamento', adicionar botão destacado: '✅ Confirmar Pagamento Recebido', ao clicar: mudar status para 'pagamento_confirmado' → 'aguardando_montagem', liberar acesso do aluno para ver progresso, notificar aluno (flag no localStorage), iniciar contagem dos 7 dias, adicionar campo 'Data Pagamento Confirmado'.","type":"feature","passes":true,"id":95},{"description":"Adicionar campo de número de questões no formulário Individual: no onboarding quando escolhe Pacote Personalizado Individual, adicionar campo: 'Quantas questões deseja?', input type number com: min: 50, max: 500, step: 10, valor padrão: 100, helper text: 'Recomendamos entre 100-200 questões para preparação completa', salvar numQuestoes na solicitação, mostrar na visualização admin: 'Quantidade solicitada: X questões'.","type":"feature","passes":true,"id":96},{"description":"Criar sistema de timeline/barra de progresso completa com 8 estágios: 1. Pagamento Pendente (⏳ aguardando), 2. Pagamento Confirmado (✅ pago), 3. Aguardando Liberação do Criador (📋 planejamento), 4. Material Iniciado (🔨 0-25%), 5. Material em Produção (🛠️ 25-50%), 6. Material Quase no Final (🎯 50-75%), 7. Material Pronto (✅ 100%), criar componente visual de timeline horizontal ou vertical com: círculos/checkpoints para cada estágio, linha conectando os estágios, estágio atual destacado, estágios passados com check verde, estágios futuros em cinza, animação de transição entre estágios.","type":"feature","passes":true,"id":97},{"description":"Implementar controle de progresso no admin com atualização simples: na visualização da solicitação admin, mostrar timeline completa visual, adicionar dropdown ou botões para avançar estágio: 'Avançar para próximo estágio', select com todos os estágios disponíveis, ao mudar: salvar novo status com timestamp, atualizar packageStatus do usuário, calcular percentual baseado no estágio, mostrar histórico de mudanças: 'Estágio X alcançado em DD/MM/YYYY às HH:MM'.","type":"feature","passes":true,"id":98},{"description":"Sincronizar progresso em tempo real para o aluno: na página /aguardando-pacote e no dashboard, mostrar timeline visual idêntica à do admin, estágio atual animado/pulsante, mensagem descritiva para cada estágio: 'Pagamento Pendente' → 'Complete seu pagamento para iniciar', 'Pagamento Confirmado' → 'Pagamento recebido! Iniciando processo...', 'Aguardando Liberação' → 'Estamos organizando a equipe de criação...', 'Material Iniciado' → 'Começamos a criar suas questões!', 'Em Produção' → 'Já temos metade pronta!', 'Quase no Final' → 'Falta pouco para finalizar!', 'Pronto' → 'Tudo pronto! Clique para começar!', tempo estimado para conclusão de cada estágio.","type":"feature","passes":true,"id":99},{"description":"Adicionar card de status na tela inicial do aluno: na home page, se aluno tem solicitação pendente/em andamento, mostrar card destacado no topo: se status = 'aguardando_pagamento': card amarelo '🔒 Pagamento Pendente', 'Complete seu pagamento para iniciar', [Botão: Ir para Checkout], se status entre 'pagamento_confirmado' e 'material_pronto': card azul '🛠️ Seu Pedido em Andamento', timeline mini com estágio atual, progresso percentual, [Botão: Ver Progresso Completo], se status = 'pronto': card verde '🎉 Seu Pacote está Pronto!', [Botão: Começar Jornada], adicionar dismiss temporariamente se quiser.","type":"feature","passes":true,"id":100},{"description":"Criar visualização de timeline/progresso visual bonita: usar biblioteca ou CSS puro para criar timeline, opção 1 - Timeline Vertical: lista vertical com círculos à esquerda, linha conectando, texto à direita, opção 2 - Timeline Horizontal: barra horizontal no topo, checkpoints distribuídos, labels abaixo, usar cores: cinza (não iniciado), azul (em progresso), verde (concluído), amarelo (aguardando), animações suaves de transição, ícones para cada estágio (💳, ✅, 📋, 🔨, 🛠️, 🎯, 🎉).","type":"feature","passes":true,"id":101},{"description":"Adicionar dashboard do progresso para o admin: criar seção ou widget no admin 'Progresso Geral das Solicitações', mostrar estatísticas: quantas em cada estágio, gráfico de pizza ou barras, lista rápida de solicitações por estágio, alerts para solicitações paradas há muito tempo, tempo médio de conclusão, filtros rápidos por estágio.","type":"feature","passes":true,"id":102},{"description":"Adicionar botão de toggle para mostrar/ocultar senha em todos os campos de senha: identificar todos os campos de senha na aplicação (login, cadastro, editar perfil, alterar senha), adicionar botão de ícone de olho (👁️ ou 👁️‍🗨️) ao lado direito de cada campo de senha, ao clicar alternar entre type='password' (oculto) e type='text' (visível), mudar ícone dinamicamente: olho aberto quando mostrando, olho fechado/cortado quando oculto, posicionar botão dentro do input (absolute position direita), adicionar estado local (useState) para controlar visibilidade, aplicar em: página de login (/login), página de cadastro (/registro), página de editar perfil (/perfil/editar - senha atual, nova senha, confirmar senha), usar ícones SVG ou emoji, estilizar com hover e cursor pointer, garantir acessibilidade (aria-label).","type":"feature","passes":true,"id":103},{"description":"Adicionar botão 'Criar Pacote' na visualização da solicitação: na tela de detalhes da solicitação no admin, adicionar botão destacado 'Criar Pacote para este Aluno', ao clicar: abrir modal ou redirecionar para página de criação de pacote, pre-preencher todos os campos com dados da solicitação (nome do concurso, banca, matérias, número de questões, aluno atribuído já selecionado), permitir edição antes de criar, ao criar pacote: salvar ID do pacote na solicitação (campo pacoteId), atribuir automaticamente ao aluno solicitante.","type":"feature","passes":true,"id":104},{"description":"Adicionar campo pacoteId na solicitação: atualizar interface PackageRequest para incluir: pacoteId (string opcional), dataPacoteCriado (timestamp), ao criar pacote para uma solicitação vincular os dois, na visualização da solicitação mostrar: se pacote foi criado: '✅ Pacote Criado: [Nome]', botão para editar/visualizar pacote, se ainda não foi criado: botão 'Criar Pacote'.","type":"feature","passes":true,"id":105},{"description":"Atribuir automaticamente pacote ao aluno solicitante: quando pacote é criado a partir de uma solicitação, chamar automaticamente função de atribuição de pacote (assignPackageToUser), passar username/email do aluno, criar acesso ao pacote no localStorage (pacote_access_[pacoteId]), garantir que aluno vê o pacote na lista de 'Pacotes Exclusivos', vincular pacote com solicitação bidirecionalmente.","type":"feature","passes":true,"id":106},{"description":"Corrigir erro de 'acesso negado' ao acessar pacote: investigar por que aluno recebe 'acesso negado' ao clicar no pacote, verificar função de verificação de acesso a pacotes, garantir que: quando pacote é atribuído ao aluno, acesso é salvo corretamente, ao verificar acesso verifica tanto plano do usuário quanto atribuições diretas de pacotes, plano Individual permite acesso ao pacote personalizado, adicionar logs de debug para identificar onde falha, testar fluxo completo: criar pacote → atribuir → aluno acessar.","type":"bug","passes":true,"id":107},{"description":"Melhorar fluxo de criação de pacote no admin: após criar pacote a partir da solicitação, mostrar mensagem de sucesso: 'Pacote criado e atribuído ao aluno!', atualizar automaticamente status da solicitação se necessário, adicionar link rápido para adicionar questões ao pacote, na lista de pacotes destacar quais estão vinculados a solicitações, permitir navegação fácil entre solicitação ↔ pacote.","type":"feature","passes":true,"id":108},{"description":"Adicionar visualização do pacote para o aluno: quando pacote estiver pronto (status = 'pronto'), na página /aguardando-pacote mostrar card com detalhes do pacote criado: nome, número de questões adicionadas, matérias disponíveis, botão 'Começar Jornada' que leva diretamente ao pacote, ao clicar garantir que não dá erro de acesso, redirecionar para página do concurso/pacote com as questões.","type":"feature","passes":true,"id":109},{"description":"Criar sistema de permissões robusto para pacotes: criar função canAccessPackage(userId, pacoteId) que verifica: se usuário tem plano Plus (acesso a tudo), se usuário tem pacote atribuído diretamente (pacote_access_[pacoteId]), se usuário tem plano Individual e pacote foi criado para ele, usar essa função em todos os lugares que verificam acesso a pacote, garantir consistência, adicionar mensagens claras de erro se não tiver acesso: 'Este pacote não está disponível para você', 'Faça upgrade para acessar'.","type":"feature","passes":true,"id":110},{"description":"Criar página de visualização do pacote com seleção de matérias: criar rota /pacote/[id] que mostra: banner/header do pacote (nome, banca, ano, progresso geral), grid de cards de matérias com design atraente, cada card mostra: ícone colorido da matéria, nome da matéria, número de questões disponíveis, progresso (X/Y questões respondidas), barra de progresso visual, badge se matéria completa, ao clicar em uma matéria redirecionar para /pacote/[id]/materia/[disciplina] que filtra apenas questões daquela matéria do pacote, design inspirado em Netflix/Spotify com cards grandes e visuais.","type":"feature","passes":true,"id":111},{"description":"Criar componente de capas de matérias com design bonito: criar SubjectCard component com: gradientes de cores diferentes por matéria (Português: azul, Matemática: verde, Direito: roxo, etc.), ícones temáticos para cada matéria (📖 Português, 🔢 Matemática, ⚖️ Direito, 💻 Informática), animação suave ao hover (lift/scale), sombras e efeitos glassmorphism, layout responsivo (grid 2 cols mobile, 3-4 cols desktop), transições suaves entre páginas, usar cores vibrantes mas não agressivas, fonte legível e moderna.","type":"feature","passes":true,"id":112},{"description":"Remover timer/cronômetro das questões: nos componentes de quiz/questões, remover completamente: countdown timer, barra de progresso de tempo, avisos de tempo esgotado, pressão de tempo, permitir que aluno responda no seu ritmo sem pressa, manter apenas: contador de questões (1 de 50), navegação entre questões, botão próxima/anterior, possibilidade de pausar e voltar depois, remover qualquer lógica relacionada a tempo limite.","type":"feature","passes":true,"id":113},{"description":"Criar sistema de rastreamento de questões resolvidas: adicionar ao localStorage tracking de questões respondidas por usuário e pacote/concurso: quiz_answered_[username]_[pacoteId] ou similar, estrutura: { questionId: { answered: true, correct: boolean, answeredAt: timestamp, userAnswer: string } }, ao responder questão salvar no tracking, na lista de questões mostrar indicador visual: ✅ verde se respondeu corretamente, ❌ vermelho se respondeu incorretamente, ⭕ cinza se não respondeu ainda, na navegação permitir filtrar: 'Todas', 'Não respondidas', 'Respondidas', 'Corretas', 'Incorretas'.","type":"feature","passes":true,"id":114},{"description":"Melhorar navegação e fluxo do quiz: na página de questões do pacote, adicionar: breadcrumb navigation (Pacote > Matéria > Questão X), sidebar com lista de questões mostrando status de cada uma (navegação rápida), permitir pular questões e voltar depois, salvar progresso automaticamente, botão 'Voltar para Matérias' sempre visível, ao finalizar todas questões de uma matéria mostrar: tela de conclusão com estatísticas, opção de revisar questões erradas, opção de voltar para escolher outra matéria.","type":"feature","passes":true,"id":115},{"description":"Adicionar estatísticas por matéria no card: em cada card de matéria mostrar: taxa de acerto (ex: 85% de acerto), tempo total estudado (opcional, se rastrear), última vez que estudou ('Estudado há 2 dias'), streak/dias consecutivos estudando, badge de conquista se atingir 100% ou alta taxa, gráfico mini circular de progresso, cores dinâmicas baseadas no desempenho (verde bom, amarelo médio, vermelho fraco).","type":"feature","passes":true,"id":116},{"description":"Criar página de estatísticas detalhadas da matéria: ao clicar em 'Ver Estatísticas' no card da matéria, abrir página mostrando: gráfico de evolução ao longo do tempo, questões mais difíceis (menor taxa de acerto geral), seus pontos fracos específicos nessa matéria, comparação com média de outros alunos (se disponível), tempo médio por questão, recomendações de revisão, lista de questões para revisar, botão para 'Estudar Pontos Fracos' que filtra questões relevantes.","type":"feature","passes":true,"id":117},{"description":"Melhorar interface de criação de pacote com seleções clicáveis: na página de criar pacote, substituir campos de texto por: Município/Órgão - grid de botões/cards clicáveis com opções comuns (TRF, TRT, Prefeitura de São Paulo, Prefeitura do Rio, Polícia Federal, INSS, Receita Federal, etc.) + campo 'Outro' para digitar, Matérias - grid de checkboxes visuais (cards estilizados) com todas as 23 matérias, permitir selecionar múltiplas, Número de Questões - slider ou botões rápidos (50, 100, 150, 200, 300, 500) + input manual, design visual e intuitivo com cards grandes e fáceis de clicar, feedback visual ao selecionar (borda destacada, cor diferente).","type":"feature","passes":true,"id":118},{"description":"Adicionar campo de upload de edital no formulário de solicitação: na página de onboarding quando escolhe Pacote Personalizado, adicionar campo de upload de arquivo: 'Anexar Edital ou Conteúdo Programático (opcional)', aceitar formatos: PDF, PNG, JPG, JPEG, limite de 10MB, permitir arrastar e soltar (drag and drop), preview do arquivo após upload, salvar arquivo como base64 no localStorage ou gerar URL temporário, no admin mostrar o arquivo anexado com botão para visualizar/baixar, adicionar ícone de anexo se houver arquivo.","type":"feature","passes":true,"id":119},{"description":"Adicionar funcionalidade de incluir mais matérias na edição de pacote: na página de editar pacote, abaixo da lista de matérias existentes, adicionar seção 'Adicionar Mais Matérias': input de texto com botão '+', ao digitar nome da matéria e clicar '+' adicionar à lista existente (sem remover as antigas), mostrar lista atualizada de matérias com botão 'x' para remover individualmente, permitir adicionar várias de uma vez separadas por vírgula, atualizar automaticamente o array de disciplinas do pacote, salvar alterações ao clicar em 'Salvar Pacote'.","type":"feature","passes":true,"id":120},{"description":"Melhorar visualização de matérias selecionadas: quando matérias são selecionadas na criação/edição de pacote, mostrar lista visual com: chips/badges coloridos para cada matéria, ícone da matéria, botão 'x' para remover, contador 'X matérias selecionadas', opção 'Selecionar Todas' e 'Limpar Seleção', organizar por categoria (Linguagens, Ciências Exatas, Direito, etc.).","type":"feature","passes":true,"id":121},{"description":"Adicionar preview do edital anexado no admin: quando solicitação tem edital anexado, na visualização da solicitação mostrar: seção 'Edital Anexado', ícone de documento com nome do arquivo, tamanho do arquivo, data de upload, botão 'Visualizar Edital' que abre em modal ou nova aba, botão 'Baixar Edital', se for imagem mostrar preview thumbnail, se for PDF mostrar ícone de PDF.","type":"feature","passes":true,"id":122},{"description":"Criar componente reutilizável de seletor de matérias: criar SubjectSelector component que pode ser usado em: criação de pacote, edição de pacote, solicitação de pacote personalizado, props: value (array de matérias selecionadas), onChange (callback), allowCustom (permitir adicionar customizadas), maxSelection (limite de matérias), showCategories (agrupar por categoria), layout visual com grid responsivo, busca/filtro de matérias, facilitar manutenção e consistência.","type":"feature","passes":true,"id":123},{"description":"Adicionar validações ao criar pacote: garantir que ao criar pacote: pelo menos 1 matéria foi selecionada, número de questões é maior que 0, município/órgão foi selecionado ou preenchido, nome do pacote não está vazio, mostrar mensagens de erro claras se validação falhar, destacar campos com erro, desabilitar botão 'Criar Pacote' se formulário inválido, feedback visual de campos obrigatórios.","type":"feature","passes":true,"id":124},{"description":"Adicionar opção de excluir definitivamente usuários: no painel admin Gerenciar Acessos, adicionar botão 'Excluir Definitivamente' além do botão 'Excluir' existente, para usuários com status 'excluido' (já marcados como excluídos), mostrar botão vermelho 'Apagar Permanentemente', modal de confirmação com: 'ATENÇÃO: Esta ação é IRREVERSÍVEL!', 'Todos os dados do usuário serão apagados permanentemente', checkbox 'Confirmo que quero apagar definitivamente', ao confirmar remover COMPLETAMENTE do localStorage (users, quiz_registered_users, quiz_user_accesses, etc.), adicionar opção de 'Limpar Todos os Usuários Teste' com filtro (ex: usuários sem solicitações, criados nas últimas 24h, etc.).","type":"feature","passes":true,"id":125},{"description":"Atualizar progresso na mesma página sem redirecionar: na visualização da solicitação no admin, quando clicar em botões de progresso (Confirmar Pagamento, Avançar Estágio, etc.), não redirecionar para outra página, atualizar o componente localmente com novo status, mostrar toast/notificação de sucesso no canto da tela, atualizar visualmente: timeline de progresso, percentual, mensagem de status, data/hora da atualização, usar estado local (useState) para refletir mudanças instantaneamente, adicionar animação de transição suave entre estágios.","type":"feature","passes":true,"id":126},{"description":"Adicionar sistema de criar novas bancas dinamicamente: na edição/criação de pacote, se campo Banca está vazio ou 'Outra' selecionado, mostrar seção 'Adicionar Nova Banca': input de texto 'Nome da Banca', botão '+ Adicionar Banca', ao adicionar: salvar nova banca em lista global de bancas (localStorage: custom_bancas), adicionar automaticamente às opções disponíveis, selecionar a recém-criada no pacote, mostrar lista de bancas customizadas com opção de editar/remover, permitir admin gerenciar lista global de bancas.","type":"feature","passes":true,"id":127},{"description":"Adicionar sistema de criar novos órgãos dinamicamente: similar ao sistema de bancas, na edição/criação de pacote para campo Órgão/Município, se 'Outro' selecionado mostrar: input 'Nome do Órgão/Município', botão '+ Adicionar Órgão', salvar em localStorage: custom_orgaos, adicionar às opções disponíveis, selecionar automaticamente, permitir gerenciar lista de órgãos customizados.","type":"feature","passes":true,"id":128},{"description":"Criar seção de gerenciamento de opções customizadas no admin: adicionar seção 'Gerenciar Opções' no admin com abas/cards: Bancas Customizadas (lista de todas as bancas adicionadas, botão editar/excluir), Órgãos/Municípios Customizados (lista, editar/excluir), permitir adicionar novas opções diretamente dessa seção, mostrar quantos pacotes usam cada opção, avisar antes de excluir se estiver em uso.","type":"feature","passes":true,"id":129},{"description":"Melhorar feedback visual ao atualizar progresso: ao clicar em botão de progresso, mostrar: loading spinner no botão clicado, desabilitar temporariamente outros botões, após sucesso: animação de check verde, toast de confirmação com mensagem específica ('Progresso atualizado para X'), atualizar timestamp 'Atualizado agora mesmo', highlight/piscar o campo que mudou, som de sucesso (opcional), permitir desfazer mudança em 5 segundos (undo).","type":"feature","passes":true,"id":130},{"description":"Adicionar ferramenta de limpeza em massa de usuários teste: criar modal 'Limpar Usuários Teste' com opções de filtro: usuários sem solicitações, usuários criados nas últimas 24h/7 dias, usuários com email contendo 'teste' ou 'test', usuários sem atividade (nunca logaram após criar), preview da lista de usuários que serão excluídos, checkbox para confirmar exclusão em massa, contador 'X usuários serão excluídos', botão 'Excluir Todos Selecionados', barra de progresso durante exclusão.","type":"feature","passes":true,"id":131},{"description":"Ajustar visualização de pacotes exclusivos: pacotes atribuídos ao aluno devem aparecer APENAS na seção 'Seus Concursos' ou 'Pacotes Exclusivos' da tela inicial, não mostrar em outras listagens gerais de concursos, ao acessar o pacote mostrar SOMENTE as matérias que foram configuradas no pacote (filtrar disciplinas), esconder matérias que não fazem parte do pacote personalizado, destacar visualmente que é um pacote exclusivo com badge especial.","type":"feature","passes":true,"id":132},{"description":"Adicionar botão 'Iniciar Simulado' na capa do pacote: na página de visualização do pacote (/pacote/[id]), ao lado ou abaixo do banner principal, adicionar botão grande e destacado: 'Iniciar Simulado Completo', ao clicar iniciar simulado com TODAS as questões do pacote (de todas as matérias), modo aleatório ou sequencial (opção de escolha), mostrar número total de questões no botão (ex: 'Iniciar Simulado (150 questões)'), design destacado com cor chamativa.","type":"feature","passes":true,"id":133},{"description":"Clicar em matéria vai direto para questões: ao clicar em um card de matéria no grid, ao invés de ir para página intermediária, redirecionar DIRETAMENTE para a primeira questão daquela matéria, iniciar automaticamente o estudo da matéria, mostrar loading rápido durante transição, carregar questões filtradas por matéria e pacote, exibição mais fluida e rápida.","type":"feature","passes":true,"id":134},{"description":"Adicionar campo de anotações ao lado da questão: na página de visualização da questão, adicionar sidebar ou seção 'Minhas Anotações' ao lado direito (desktop) ou abaixo (mobile), textarea para aluno escrever anotações sobre a questão, salvar automaticamente no localStorage: quiz_notes_[username]_[questionId], permitir formatação básica (negrito, lista, etc.) opcional, mostrar timestamp 'Anotado em: DD/MM/YYYY HH:MM', permitir editar e excluir anotações, ícone indicando se questão tem anotação na lista.","type":"feature","passes":true,"id":135},{"description":"Adicionar sugestões de técnicas de estudo após comentários: abaixo da seção de comentários da questão, adicionar card/seção: '💡 Técnicas de Estudo Recomendadas', rotacionar sugestões entre: Estudo Reverso (explain back), Leitura Dinâmica, Estudo Ativo, Repetição Espaçada, Mnemotécnicas, Mapas Mentais, Técnica Pomodoro, Resumos Próprios, para cada técnica mostrar: nome, breve descrição (1-2 linhas), como aplicar nesta questão, escolher técnica aleatória ou baseada no tipo de questão/matéria.","type":"feature","passes":true,"id":136},{"description":"Melhorar layout da página de questão com anotações: criar layout de 2 colunas (desktop): coluna esquerda (70%): questão, alternativas, comentários, técnicas, coluna direita (30%): anotações fixas/sticky, em mobile: questão primeiro, botão expansível 'Ver Anotações', anotações em modal ou seção colapsável, garantir responsividade, manter navegação fluida.","type":"feature","passes":true,"id":137},{"description":"Criar sistema de técnicas de estudo inteligente: banco de técnicas com: id, nome, descrição, aplicação, disciplinas recomendadas, lógica para escolher técnica baseada em: disciplina da questão (Matemática → resolução de problemas, Português → leitura ativa), se aluno errou ou acertou, tipo de questão (interpretativa, decoreba, cálculo), histórico de desempenho do aluno, variar técnicas para não repetir sempre a mesma, permitir aluno marcar técnicas como favoritas.","type":"feature","passes":true,"id":138},{"description":"Corrigir exibição da foto de perfil: verificar componente AppHeader onde foto deve aparecer, garantir que ao salvar foto no /perfil/editar está salvando no localStorage com chave correta (ex: user_profile_photo_[username]), ao carregar verifica se existe foto salva e exibe, se não tiver foto mostrar avatar com iniciais do nome, adicionar logs para debug, testar fluxo completo: upload foto → salvar → navegar → foto aparece no header, verificar se base64 está sendo tratado corretamente.","type":"bug","passes":true,"id":139},{"description":"Mostrar 'Seus Pacotes Exclusivos' APENAS para plano Individual: na tela inicial (index.tsx), verificar plano do usuário antes de mostrar seção, se plano = 'individual' E tem pacotes atribuídos: mostrar seção 'Seus Pacotes Exclusivos', se plano = 'plus' ou 'free': NÃO mostrar essa seção (mostrar grid de concursos gerais), usar lógica condicional clara para separar visualizações por plano.","type":"feature","passes":true,"id":140},{"description":"Remover 'Escolha um concurso para estudar' para plano Individual: na tela inicial, se usuário tem plano Individual: NÃO mostrar grid de concursos gerais, mostrar APENAS seus pacotes exclusivos, mensagem: 'Seu pacote personalizado está pronto para estudar!', se usuário tem plano Plus ou Gratuito: mostrar grid normal de concursos, título 'Escolha um concurso para estudar', acesso total aos concursos da plataforma.","type":"feature","passes":true,"id":141},{"description":"Corrigir bug ao selecionar alternativa nas questões do pacote: nas páginas pacote-materia.tsx e pacote-estudar.tsx, verificar handler de seleção de alternativas (onChange do radio button), garantir que estado está sendo atualizado corretamente, verificar se não há conflito de IDs nos inputs, adicionar logs para debug quando clica em alternativa, testar seleção de cada alternativa A, B, C, D, garantir feedback visual ao selecionar (radio marcado).","type":"bug","passes":true,"id":142},{"description":"Garantir que comentários e técnicas de estudo aparecem: após responder questão, verificar se componente de comentário está renderizando, se question.comentario existe, mostrar seção de comentário, após comentário, mostrar seção de técnica de estudo, verificar importação e uso de getRecommendedTechnique(), adicionar fallback se não houver comentário, testar fluxo: responder → ver resposta → comentário aparece → técnica aparece.","type":"bug","passes":true,"id":143},{"description":"Verificar e corrigir sistema de salvamento de anotações: revisar funções saveNote() e loadNote() em notes.ts, garantir que chave do localStorage está correta: quiz_notes_[username]_[questionId], ao digitar no textarea chamar saveNote com debounce, ao carregar questão chamar loadNote para recuperar anotação anterior, adicionar mensagem de feedback: 'Anotação salva ✓', mostrar timestamp da última edição, testar: escrever nota → sair da questão → voltar → nota ainda está lá.","type":"bug","passes":true,"id":144},{"description":"Adicionar botão explícito 'Salvar Anotação' além do auto-save: abaixo do textarea de anotações adicionar: botão 'Salvar Anotação' (verde), ao clicar salvar imediatamente e mostrar toast '✓ Anotação salva com sucesso!', desabilitar botão se textarea vazio, mostrar indicador se há mudanças não salvas (*), mesmo com auto-save manter botão para garantia do usuário.","type":"feature","passes":true,"id":145},{"description":"Corrigir completamente a seleção de alternativas: remover a verificação 'if (selectedAnswer !== null)' que impede de selecionar antes de responder, adicionar estado temporário selectedOption para armazenar opção antes de confirmar, alterar o botão para permitir seleção livre com feedback verde imediato, ao clicar na alternativa: marcar visualmente com verde, botão 'Responder' fica habilitado, clicar 'Responder' confirma e mostra resultado, garantir que feedback verde aparece IMEDIATAMENTE ao clicar.","type":"bug","passes":true,"id":146},{"description":"Adicionar log de debug e simplificar lógica de exibição: adicionar console.log em pontos críticos: ao selecionar alternativa, ao mostrar explanação, ao renderizar comentário, ao renderizar técnica, verificar se currentQuestion.explanation existe e tem conteúdo, garantir que showExplanation está setado para true após responder, verificar se currentTechnique não é null/undefined antes de renderizar, adicionar fallbacks caso dados não estejam disponíveis.","type":"bug","passes":true,"id":147},{"description":"Criar versão simplificada da seleção de alternativas: separar em 2 estados: selectedOption (selecionado mas não confirmado) e confirmedAnswer (confirmado), ao clicar em alternativa: apenas seta selectedOption, muda cor para verde, ao clicar botão 'Responder': seta confirmedAnswer = selectedOption, mostra resultado (certo/errado), mostra explanação, mostra técnica, CSS: .option-selected { background-color: rgb(34 197 94 / 0.2); border-color: rgb(34 197 94); }, garantir transições suaves.","type":"feature","passes":true,"id":148},{"description":"Garantir que explanação e técnica sempre renderizam: usar operador de coalescência nula: {showExplanation && currentQuestion?.explanation || 'Sem comentário disponível'}, para técnica: sempre mostrar após responder, mesmo se currentTechnique falhar, ter técnica genérica de fallback, adicionar botão 'Ver Comentário' expansível para garantir que sempre aparece, styled como acordeão com animação.","type":"bug","passes":true,"id":149},{"description":"Adicionar botão 'Responder' grande e visível: após selecionar alternativa (selectedOption !== null), mostrar botão grande verde: 'Confirmar Resposta', apenas após clicar neste botão que valida e mostra resultado, botão estilo: bg-emerald-500 hover:bg-emerald-600, w-full py-4 rounded-xl font-semibold, feedback: Loading ao processar, Success ao confirmar.","type":"feature","passes":true,"id":150},{"description":"Implementar novo fluxo de resposta em 3 etapas: ETAPA 1 - Selecionar: aluno clica em alternativa, apenas highlight sutil (sem verde/vermelho), botão 'Responder' aparece. ETAPA 2 - Responder: aluno clica 'Responder', registra resposta mas NÃO mostra cores ainda, botão 'Ver Resposta' aparece. ETAPA 3 - Ver Resposta: aluno clica 'Ver Resposta', AGORA mostra cores: verde na CORRETA, vermelho na ERRADA (se diferente), botão 'Ver Comentário' aparece. Estados: selectedOption, hasAnswered, showResult, showComments.","type":"feature","passes":true,"id":151},{"description":"Ajustar cores das alternativas: ANTES de 'Ver Resposta': alternativa selecionada com borda azul/laranja suave, SEM verde/vermelho, APÓS 'Ver Resposta': alternativa CORRETA sempre verde (independente da selecionada), alternativa ERRADA selecionada pelo aluno em vermelho, outras em cinza desbotado, usar CSS claro: .correct { bg-emerald-500/20, border-emerald-500 }, .incorrect { bg-rose-500/20, border-rose-500 }.","type":"feature","passes":true,"id":152},{"description":"Criar botão 'Ver Comentário' colapsável: após clicar 'Ver Resposta', mostrar botão 'Ver Comentário' centralizado, ao clicar expandir seção de comentários com animação suave (slide down), comentários inicialmente ocultos (collapsed), usar acordeão com transição CSS, ícone muda: ▼ quando fechado, ▲ quando aberto, botão muda texto: 'Ver Comentário' -> 'Ocultar Comentário'.","type":"feature","passes":true,"id":153},{"description":"Posicionar técnicas de estudo logo abaixo dos comentários: quando comentários são expandidos, mostrar técnicas de estudo DENTRO da mesma seção expandida, ordem: 1. Feedback de acerto/erro, 2. Botão 'Ver Resposta', 3. [Após clicar] Cores aparecem, 4. Botão 'Ver Comentário', 5. [Após clicar] Comentários + Técnicas, separar visualmente com linha ou espaçamento, técnicas ficam visíveis junto com comentários.","type":"feature","passes":true,"id":154},{"description":"Remover botão 'Iniciar Simulado' da página inicial (home/index.tsx): na tela inicial do aluno, remover qualquer botão 'Iniciar Simulado', 'Estudar Tudo' ou similar que inicia todas as questões de uma vez, manter apenas: cards de pacotes exclusivos (para plano Individual), cards de concursos (para plano Plus/Gratuito), cards de matérias ao clicar no concurso, botão de iniciar simulado só deve existir DENTRO da página do pacote (/pacote/[id]).","type":"feature","passes":true,"id":155},{"description":"Implementar estados claros para o fluxo: criar estados: const [selectedOption, setSelectedOption] - opção selecionada, const [hasAnswered, setHasAnswered] - já clicou 'Responder', const [showResult, setShowResult] - já clicou 'Ver Resposta', const [showComments, setShowComments] - expandiu comentários, lógica de renderização condicional clara para cada estado, garantir transições suaves entre estados, prevenir bugs de estado inconsistente.","type":"feature","passes":true,"id":156},{"description":"Adicionar feedback visual claro em cada etapa: SELECIONANDO: borda azul na selecionada + botão 'Responder' azul, RESPONDIDO: desabilita alternativas + botão 'Ver Resposta' laranja pulsante, VER RESPOSTA: cores verde/vermelho + botão 'Ver Comentário' roxo, COMENTÁRIOS ABERTOS: seção expandida com técnicas visíveis, usar cores distintas para cada botão evitando confusão, adicionar ícones nos botões para clareza visual.","type":"feature","passes":true,"id":157},{"description":"Ensure the app is properly configured and ready for visual editing","type":"feature","passes":true,"id":158},{"description":"Editor visual ativado - app pronto para edições","type":"feature","passes":true,"id":159},{"description":"Verificar estrutura atual do projeto e garantir que está funcionando corretamente","type":"feature","passes":true,"id":160},{"description":"Verificar e garantir que o projeto está funcionando corretamente","type":"bug","passes":true,"id":161},{"description":"Adicionar configurações de SEO melhoradas no index.html com meta tags para redes sociais e busca","type":"feature","passes":true,"id":162},{"description":"Modificar a página de login para usar Supabase Auth ao invés de Better Auth. O botão 'Entrar com Google' deve chamar supabase.auth.signInWithOAuth({ provider: 'google' }) e redirecionar corretamente sem erros de sandbox. Manter o design atual do botão.","type":"bug","passes":true,"id":163},{"description":"Adicionar verificação de admin via Supabase user_metadata. Permitir que qualquer usuário com user_metadata.role='admin' ou email específico seja admin. Modificar o arquivo access-control.ts para verificar o email do usuário logado via Supabase e comparar com lista de SUPER_ADMINS, adicionando também verificação de role no user_data do Supabase.","type":"feature","passes":true,"id":164},{"description":"Atualizar a página escolher-simulado.tsx com botões mais interativos e legais: adicionar ícones para cada banca (CESPE/CEBRASPE, FCC, VUNESP, FGV, IBFC, CESGRANRIO), cores gradientes diferentes para cada botão, animações de hover com scale e glow, efeito shimmer ao passar o mouse, ícone de check quando selecionado, animações de entrada (fade-in e slide-up), seção de matérias também com ícones (📖 Português, 🔢 Matemática, ⚖️ Direito Constitucional, 🏛️ Direito Administrativo, 💻 Informática, 🧠 Raciocínio Lógico) e cores diferentes, resumo da seleção antes do botão iniciar, botão Iniciar Simulado maior e mais chamativo com efeitos de hover","type":"feature","passes":true,"id":165},{"description":"Página de escolher simulado com botões interativos, animações, gradientes coloridos e efeitos de hover já implementada","type":"feature","passes":true,"id":166},{"description":"Atualizar botões interativos na página de escolha de simulado com animações, ícones e efeitos visuais melhorados","type":"feature","passes":true,"id":167},{"description":"Criar menu lateral interativo na tela inicial (dashboard) com botões estilizados para: Início, Questões e Estatísticas - seguindo o design da imagem em /home/user/Attachments/5a7236d0-768b-43a9-a070-19b2e8b64d87.png","type":"feature","passes":true,"id":168},{"description":"Corrigir métricas do dashboard que não estão corretas. As métricas (Questões Respondidas, Taxa de Acerto, Dias Seguidos, Tempo de Estudo) devem buscar dados REAIS do Supabase na tabela user_stats ou calcular a partir das respostas do usuário logado. Não usar dados mockados/fictícios.","type":"bug","passes":true,"id":169},{"description":"No Plano Plus: adicionar botão de comentários em ÁUDIO nas questões. Quando o usuário clicar em 'Ouvir Comentário', deve usar a API de Text-to-Speech para reproduzir o comentário da questão. Só disponível para plano Plus.","type":"feature","passes":true,"id":170},{"description":"No Plano Plus: adicionar botão 'Pesquisar com ChatGPT' na tela de questões. Ao clicar, abre um modal onde o usuário pode fazer perguntas sobre a questão atual para o ChatGPT. Usar a API de AI existente no projeto.","type":"feature","passes":true,"id":171},{"description":"No painel Admin, na seção de Solicitações/Pedidos: adicionar botões para mudar o status do pedido (aguardando_pagamento, aguardando_montagem, em_andamento, pronto, cancelado). Permitir clicar e alterar o status de cada pedido individualmente.","type":"feature","passes":true,"id":172},{"description":"Configurar o admin (email: danthulver@gmail.com) como usuário Plus com TODAS as funcionalidades desbloqueadas: comentários em áudio, ChatGPT ilimitado, todas as matérias, todas as bancas disponíveis. Salvar no Supabase na tabela profiles com plan='plus'.","type":"feature","passes":true,"id":173},{"description":"Adicionar 100 questões fictícias no arquivo questoes-iniciais.ts para teste. As questões devem cobrir todas as bancas (CESPE, FCC, VUNESP, FGV, IBFC, CESGRANRIO) e todas as matérias (Português, Matemática, Direito Constitucional, Direito Administrativo, Informática, Raciocínio Lógico). Cada questão deve ter: id, disciplina, concurso, banca, title, optionA, optionB, optionC, optionD, correctAnswer, explanation, e audioComment (URL fictícia para teste de áudio).","type":"feature","passes":true,"id":174},{"description":"Na tela inicial (index.tsx), adicionar um menu lateral fixo estilizado com 3 botões interativos: Início (com ícone de casa), Questões (com ícone de livro), Estatísticas (com ícone de gráfico). Os botões devem ter efeito hover, o botão ativo deve ter fundo azul/gradiente, e deve ter animações suaves. O menu deve ficar na lateral esquerda em desktop e virar barra inferior em mobile.","type":"feature","passes":true,"id":175},{"description":"Adicionar menu lateral interativo na tela inicial da página index.tsx com botões Início, QUESTÕES e Estatísticas conforme imagem em /home/user/Attachments/5a7236d0-768b-43a9-a070-19b2e8b64d87.png - deve ser um menu fixo no lado esquerdo com animações","type":"feature","passes":true,"id":176},{"description":"Configurar perfil admin (email danthulver@gmail.com) como plano Plus com acesso ilimitado, todas bancas liberadas e 200 mensagens de IA por mês no arquivo access-control.ts","type":"feature","passes":true,"id":177},{"description":"Adicionar botão 'Pesquisar com ChatGPT' nas questões para usuários Plus que abre modal com chat IA integrado na página index.tsx - botão visível apenas após responder a questão","type":"feature","passes":true,"id":178},{"description":"Adicionar botão de áudio player para reproduzir comentários em áudio nas questões (campo audioComment) - visível apenas para usuários Plus após responder na página index.tsx","type":"feature","passes":true,"id":179},{"description":"Corrigir cálculo de métricas no dashboard.tsx - questões respondidas, taxa de acerto, dias seguidos e tempo de estudo devem usar dados reais do user-stats.ts","type":"bug","passes":true,"id":180},{"description":"Adicionar botão grande 'Comece as questões aqui' no centro do dashboard, logo após o header. Deve ter design destacado com gradiente laranja, ícone de livro, e redirecionar para a página de questões (rota /)","type":"feature","passes":true,"id":181},{"description":"Remover o item 'QUESTÕES' do menu lateral (sidebar-menu.tsx), deixando apenas 'Início' e 'Estatísticas'","type":"feature","passes":true,"id":182},{"description":"No botão de áudio das questões (Plus only), fazer tocar arquivo de áudio real quando disponível (campo audioComment da questão), com fallback para TTS","type":"feature","passes":true,"id":183},{"description":"Adicionar botão grande 'Comece as questões aqui' no centro do dashboard (dashboard.tsx), logo após o AppHeader. Deve ter design destacado com gradiente laranja, ícone de livro 📚, e redirecionar para a página de questões (rota /). Usar classes: glass-card, rounded-3xl, bg-gradient-to-br from-orange-500/20 to-amber-500/10, border-2 border-orange-500/30","type":"feature","passes":true,"id":184},{"description":"Remover o item 'QUESTÕES' do menu lateral (sidebar-menu.tsx), deixando apenas 'Início' e 'Estatísticas' no array menuItems","type":"feature","passes":true,"id":185},{"description":"No botão de áudio das questões em index.tsx (Plus only), verificar se currentQuestion tem campo audioComment. Se tiver, tocar o arquivo de áudio com new Audio(audioFile).play(). Se não tiver ou falhar, usar fallback TTS com speechSynthesis","type":"feature","passes":true,"id":186},{"description":"Adicionar botão grande 'Comece as questões aqui' no centro do dashboard (dashboard.tsx), logo após o AppHeader. Deve ter design destacado com gradiente laranja, ícone de livro 📚, e redirecionar para a página de questões (rota /). Usar classes: glass-card, rounded-3xl, bg-gradient-to-br from-orange-500/20 to-amber-500/10, border-2 border-orange-500/30","type":"feature","passes":true,"id":187},{"description":"Remover o item 'QUESTÕES' do menu lateral (sidebar-menu.tsx), deixando apenas 'Início' e 'Estatísticas' no array menuItems","type":"feature","passes":true,"id":188},{"description":"No botão de áudio das questões em index.tsx (Plus only), verificar se currentQuestion tem campo audioComment. Se tiver, tocar o arquivo de áudio com new Audio(audioFile).play(). Se não tiver ou falhar, usar fallback TTS com speechSynthesis","type":"feature","passes":true,"id":189},{"description":"Adicionar botão grande 'Comece as questões aqui' no centro do dashboard (dashboard.tsx), logo após o AppHeader. Deve ter design destacado com gradiente laranja, ícone de livro 📚, e redirecionar para a página de questões (rota /). Usar classes: glass-card, rounded-3xl, bg-gradient-to-br from-orange-500/20 to-amber-500/10, border-2 border-orange-500/30","type":"feature","passes":true,"id":190},{"description":"Remover o item 'QUESTÕES' do menu lateral (sidebar-menu.tsx), deixando apenas 'Início' e 'Estatísticas' no array menuItems","type":"feature","passes":true,"id":191},{"description":"No botão de áudio das questões em index.tsx (Plus only), verificar se currentQuestion tem campo audioComment. Se tiver, tocar o arquivo de áudio com new Audio(audioFile).play(). Se não tiver ou falhar, usar fallback TTS com speechSynthesis","type":"feature","passes":true,"id":192}]